#### Outcome: 🟨  add=0 change=1 destroy=0
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```\n
TALOSCONFIG not found and TALOSCONFIG_TEXT not defined
Using KUBECONFIG_TEXT to create /tmp/talosconfig
[32m[1mSuccess![0m The configuration is valid.[0m
```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff
TALOSCONFIG not found and TALOSCONFIG_TEXT not defined
Using KUBECONFIG_TEXT to create /tmp/talosconfig

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
! ~ update in-place (current -> planned)

OpenTofu will perform the following actions:

# # helm_release.flux_homelab will be updated in-place
! ~ resource "helm_release" "flux_homelab" {
!     ~ id                         = "homelab" -> (known after apply)
!     ~ metadata                   = {
!         ~ app_version    = "2.8.2" -> (known after apply)
!         ~ chart          = "flux2-sync" -> (known after apply)
!         ~ first_deployed = 1769430593 -> (known after apply)
!         ~ last_deployed  = 1773690664 -> (known after apply)
!         ~ name           = "homelab" -> (known after apply)
!         ~ namespace      = "flux-system" -> (known after apply)
!         ~ notes          = "" -> (known after apply)
!         ~ revision       = 3 -> (known after apply)
!         ~ values         = jsonencode(
+               {
-                 - gitRepository = {
-                     - spec = {
-                         - ref       = {
-                             - branch = "(sensitive value)"
+                           }
-                         - secretRef = {
-                             - name = "repo-access"
+                           }
-                         - url       = "(sensitive value)"
+                       }
+                   }
-                 - kustomization = {
-                     - spec = {
-                         - path      = "(sensitive value)"
-                         - postBuild = {
-                             - substitute = {
-                                 - root_domain = "(sensitive value)"
+                               }
+                           }
+                       }
+                   }
+               }
+           ) -> (known after apply)
!         ~ version        = "1.14.3" -> (known after apply)
+       } -> (known after apply)
+       name                       = "homelab"
!     ~ set_wo                     = (write-only attribute)
!     ~ version                    = "1.14.3" -> "1.14.4"
#       # (30 unchanged attributes hidden)
+   }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>

*Pusher: @rk-rosie-bot[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Full CI/CD Pipeline`*`;
<!-- Sticky Pull Request Commentdevelopment-k8s -->